Revit 2024 API
CorrectionFactorSet Class
A set that contains correction factors.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class CorrectionFactorSet : APIObject,
	IEnumerable
Visual Basic
Public Class CorrectionFactorSet _
	Inherits APIObject _
	Implements IEnumerable
Visual C++
public ref class CorrectionFactorSet : public APIObject,
	IEnumerable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Electrical.CorrectionFactorSet
See Also
CorrectionFactorSet Members
Autodesk.Revit.DB.Electrical Namespace